In [1]:
import pandas as pd
import numpy as np
import timeit

def print_series(sr: pd.Series):
    print(sr.to_string(max_rows=10, dtype=True))
    print()

def test_solutions(solution_1, solution_2):
    # Test performance with timeit
    time_1 = timeit.timeit(solution_1, number=100)
    time_2 = timeit.timeit(solution_2, number=100)

    print(f"Solution 1 Time: {time_1:.6f} seconds")
    print(f"Solution 2 Time: {time_2:.6f} seconds")

data = {
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']}

df = pd.DataFrame(data)

##### 1.  Write a Pandas program to display the default index and set a column as an Index in a given dataframe.

In [17]:
df.set_index('school_code')

            class            name date_Of_Birth  weight  address t_id
school_code
s001            V  Alberto Franco    15/05/2002      35  street1   t1
s002            V    Gino Mcneill    17/05/2002      32  street2   t2
s003           VI     Ryan Parkes    16/02/1999      33  street3   t3
s001           VI    Eesha Hinton    25/09/1998      30  street1   t4
s002            V    Gino Mcneill    11/05/2002      31  street2   t5
s004           VI    David Parkes    15/09/1997      32  street4   t6

##### 2. Write a Pandas program to create a multi Index frame using two columns and using an Index and a column.

In [24]:
print('a multi Index frame using two columns')
print(df.set_index(['school_code', 't_id']))

print('a multi Index frame using an Index and a column')
print(df.set_index([df.index, 't_id']))

a multi Index frame using two columns
                 class            name date_Of_Birth  weight  address
school_code t_id
s001        t1       V  Alberto Franco    15/05/2002      35  street1
s002        t2       V    Gino Mcneill    17/05/2002      32  street2
s003        t3      VI     Ryan Parkes    16/02/1999      33  street3
s001        t4      VI    Eesha Hinton    25/09/1998      30  street1
s002        t5       V    Gino Mcneill    11/05/2002      31  street2
s004        t6      VI    David Parkes    15/09/1997      32  street4
a multi Index frame using two columns
       school_code class            name date_Of_Birth  weight  address
  t_id
0 t1          s001     V  Alberto Franco    15/05/2002      35  street1
1 t2          s002     V    Gino Mcneill    17/05/2002      32  street2
2 t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
3 t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
4 t5          s002     V    Gino Mcneill    11/05/2002      31  street2
5 t6          s004    VI    David Parkes    15/09/1997      32  street4

##### 3. Write a Pandas program to display the default index and set a column as an Index in a given dataframe and then reset the index.

In [28]:
print('Default index:')
print(df.index)

print('\nset a column as an Index')
df1 = df.set_index('t_id')
print(df1)

print('\nreset index')
print(df1.reset_index())

Default index:
RangeIndex(start=0, stop=6, step=1)

set a column as an Index
     school_code class            name date_Of_Birth  weight  address
t_id
t1          s001     V  Alberto Franco    15/05/2002      35  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s004    VI    David Parkes    15/09/1997      32  street4

reset index
  t_id school_code class            name date_Of_Birth  weight  address
0   t1        s001     V  Alberto Franco    15/05/2002      35  street1
1   t2        s002     V    Gino Mcneill    17/05/2002      32  street2
2   t3        s003    VI     Ryan Parkes    16/02/1999      33  street3
3   t4        s001    VI    Eesha Hinton    25/09/1998      30  street1
4   t5        s002     V    Gino Mcneill    11/05/2002      31  street2
5   t6        s004    VI    David Parkes    15/09/1997      32  street4

##### 4. Write a Pandas program to create an index labels by using 64-bit integers, using floating-point numbers in a given dataframe.

In [39]:
df1 = df.set_index(df['weight'].values)
print(df1)
print(df1.index)

print()

df2 = df.set_index(pd.Index([1.1, 1.2, 1.3, 1.4, 1.5, 1.6]))
print(df2)
print(df2.index)

   school_code class            name date_Of_Birth  weight  address t_id
35        s001     V  Alberto Franco    15/05/2002      35  street1   t1
32        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
33        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
30        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
31        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
32        s004    VI    David Parkes    15/09/1997      32  street4   t6
Index([35, 32, 33, 30, 31, 32], dtype='int64')

    school_code class            name date_Of_Birth  weight  address t_id
1.1        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1.2        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
1.3        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
1.4        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
1.5        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
1.6        s004    VI    David Parkes    15/09/1997      32  street4   t6
Index([1.1, 1.2, 1.3, 1.4, 1.5, 1.6], dtype='float64')

In [40]:
print("Create an Int64Index:")
df_i64 = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=[1, 2, 3, 4, 5, 6])
print(df_i64)
print("\nView the Index:")
print(df_i64.index)

print("\nFloating-point labels using Float64Index:")
df_f64 = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=[.1, .2, .3, .4, .5, .6])
print(df_f64)
print("\nView the Index:")
print(df_f64.index)

Create an Int64Index:
  school_code class            name date_Of_Birth  weight  address
1        s001     V  Alberto Franco    15/05/2002      35  street1
2        s002     V    Gino Mcneill    17/05/2002      32  street2
3        s003    VI     Ryan Parkes    16/02/1999      33  street3
4        s001    VI    Eesha Hinton    25/09/1998      30  street1
5        s002     V    Gino Mcneill    11/05/2002      31  street2
6        s004    VI    David Parkes    15/09/1997      32  street4

View the Index:
Index([1, 2, 3, 4, 5, 6], dtype='int64')

Floating-point labels using Float64Index:
    school_code class            name date_Of_Birth   weight  address
0.1        s001     V  Alberto Franco     15/05/2002      35  street1
0.2        s002     V    Gino Mcneill     17/05/2002      32  street2
0.3        s003    VI     Ryan Parkes     16/02/1999      33  street3
0.4        s001    VI    Eesha Hinton     25/09/1998      30  street1
0.5        s002     V    Gino Mcneill     11/05/2002      31  street2
0.6        s004    VI    David Parkes     15/09/1997      32  street4

View the Index:
Index([0.1, 0.2, 0.3, 0.4, 0.5, 0.6], dtype='float64')

##### 5. Write a Pandas program to create a DataFrame using intervals as an index.

In [41]:
df = pd.DataFrame(np.arange(5), index=pd.interval_range(start=0, end=5))
df

        0
(0, 1]  0
(1, 2]  1
(2, 3]  2
(3, 4]  3
(4, 5]  4

In [43]:
print("Create an Interval Index using IntervalIndex.from_breaks:")
df_interval = pd.DataFrame(
    {"X":[1, 2, 3, 4, 5, 6, 7]},
    index = pd.IntervalIndex.from_breaks(
        [0, 0.5, 1.0, 1.5, 2.0, 2.5, 3, 3.5]
    )
)    
print(df_interval)
print(df_interval.index)

print("\nCreate an Interval Index using IntervalIndex.from_tuples:")
df_interval = pd.DataFrame(
    {"X":[1, 2, 3, 4, 5, 6, 7]},             
    index = pd.IntervalIndex.from_tuples(
        [(0, .5), (.5, 1), (1, 1.5), (1.5, 2), (2, 2.5), (2.5, 3), (3, 3.5)]
    )
)
print(df_interval)
print(df_interval.index)

print("\nCreate an Interval Index using IntervalIndex.from_arrays:")
df_interval = pd.DataFrame(
    {"X":[1, 2, 3, 4, 5, 6, 7]},             
    index = pd.IntervalIndex.from_arrays(
        [0, .5, 1, 1.5, 2, 2.5, 3], [.5, 1, 1.5, 2, 2.5, 3, 3.5]
    )
)
print(df_interval)
print(df_interval.index)

Create an Interval Index using IntervalIndex.from_breaks:
            X
(0.0, 0.5]  1
(0.5, 1.0]  2
(1.0, 1.5]  3
(1.5, 2.0]  4
(2.0, 2.5]  5
(2.5, 3.0]  6
(3.0, 3.5]  7
IntervalIndex([(0.0, 0.5], (0.5, 1.0], (1.0, 1.5], (1.5, 2.0], (2.0, 2.5],
               (2.5, 3.0], (3.0, 3.5]],
              dtype='interval[float64, right]')

Create an Interval Index using IntervalIndex.from_tuples:
            X
(0.0, 0.5]  1
(0.5, 1.0]  2
(1.0, 1.5]  3
(1.5, 2.0]  4
(2.0, 2.5]  5
(2.5, 3.0]  6
(3.0, 3.5]  7
IntervalIndex([(0.0, 0.5], (0.5, 1.0], (1.0, 1.5], (1.5, 2.0], (2.0, 2.5],
               (2.5, 3.0], (3.0, 3.5]],
              dtype='interval[float64, right]')

Create an Interval Index using IntervalIndex.from_arrays:
            X
(0.0, 0.5]  1
(0.5, 1.0]  2
(1.0, 1.5]  3
(1.5, 2.0]  4
(2.0, 2.5]  5
(2.5, 3.0]  6
(3.0, 3.5]  7
IntervalIndex([(0.0, 0.5], (0.5, 1.0], (1.0, 1.5], (1.5, 2.0], (2.0, 2.5],
               (2.5, 3.0], (3.0, 3.5]],
              dtype='interval[float64, right]')

##### 6. Write a Pandas program to create a dataframe indexing by date and time.

In [47]:
dt_range = pd.date_range('2024-01-01 12:00:00', periods=6)

print('dt_range')
print(dt_range)

print()

df = pd.DataFrame(
    data,
    index=dt_range
)
print('DataFrame')
print(df)

print()

print('Index')
print(df.index)

dt_range
DatetimeIndex(['2024-01-01 12:00:00', '2024-01-02 12:00:00',
               '2024-01-03 12:00:00', '2024-01-04 12:00:00',
               '2024-01-05 12:00:00', '2024-01-06 12:00:00'],
              dtype='datetime64[ns]', freq='D')

DataFrame
                    school_code class            name date_Of_Birth  weight  \
2024-01-01 12:00:00        s001     V  Alberto Franco    15/05/2002      35
2024-01-02 12:00:00        s002     V    Gino Mcneill    17/05/2002      32
2024-01-03 12:00:00        s003    VI     Ryan Parkes    16/02/1999      33
2024-01-04 12:00:00        s001    VI    Eesha Hinton    25/09/1998      30
2024-01-05 12:00:00        s002     V    Gino Mcneill    11/05/2002      31
2024-01-06 12:00:00        s004    VI    David Parkes    15/09/1997      32

                     address t_id
2024-01-01 12:00:00  street1   t1
2024-01-02 12:00:00  street2   t2
2024-01-03 12:00:00  street3   t3
2024-01-04 12:00:00  street1   t4
2024-01-05 12:00:00  street2   t5
2024-01-06 12:00:00  street4   t6

Index
DatetimeIndex(['2024-01-01 12:00:00', '2024-01-02 12:00:00',
               '2024-01-03 12:00:00', '2024-01-04 12:00:00',
               '2024-01-05 12:00:00', '2024-01-06 12:00:00'],
              dtype='datetime64[ns]', freq='D')

##### 7. Write a Pandas program to create a dataframe and set a title or name of the index column.

In [62]:
df = pd.DataFrame(data)
print(df.rename_axis('idx'))
print()

df.index.name = 'idx'
print(df)
print()

print(df.rename_axis('rows').rename_axis('columns', axis=1))
print()

df = pd.DataFrame(data)
df.columns.name = 'columns'
df.index.name = 'rows'
print(df)

    school_code class            name date_Of_Birth  weight  address t_id
idx
0          s001     V  Alberto Franco    15/05/2002      35  street1   t1
1          s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2          s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3          s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4          s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5          s004    VI    David Parkes    15/09/1997      32  street4   t6

    school_code class            name date_Of_Birth  weight  address t_id
idx
0          s001     V  Alberto Franco    15/05/2002      35  street1   t1
1          s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2          s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3          s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4          s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5          s004    VI    David Parkes    15/09/1997      32  street4   t6

columns school_code class            name date_Of_Birth  weight  address t_id
rows
0              s001     V  Alberto Franco    15/05/2002      35  street1   t1
1              s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2              s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3              s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4              s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5              s004    VI    David Parkes    15/09/1997      32  street4   t6

columns school_code class            name date_Of_Birth  weight  address t_id
rows
0              s001     V  Alberto Franco    15/05/2002      35  street1   t1
1              s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2              s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3              s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4              s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5              s004    VI    David Parkes    15/09/1997      32  street4   t6

##### 8. Write a Pandas program to set value in a specific cell in a given dataframe using index.

In [89]:
df1 = df.set_index(df.t_id).drop('t_id', axis=1)
df1.loc[pd.Index(['t1']), ['weight']] = 40
print(df1)

df1.at['t6', 'school_code'] = 's005'
print(df1)

print()

df1.at['t1', 'date_of_birth'] = '16/05/2002'
print(df1)

     school_code class            name date_of_birth  weight  address
t_id
t1          s001     V  Alberto Franco    15/05/2002      40  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s004    VI    David Parkes    15/09/1997      32  street4
     school_code class            name date_of_birth  weight  address
t_id
t1          s001     V  Alberto Franco    15/05/2002      40  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s005    VI    David Parkes    15/09/1997      32  street4

     school_code class            name date_of_birth  weight  address
t_id
t1          s001     V  Alberto Franco    16/05/2002      40  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s005    VI    David Parkes    15/09/1997      32  street4

In [90]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])

print("Original DataFrame:")
print(df)

print("\nSet school code 's004' to 's005':")
df.at['t6', 'school_code'] = 's005'
print(df)

print("\nSet date_of_birth of 'Alberto Franco' to '16/05/2002':")
df.at['t1', 'date_of_birth'] = '16/05/2002'
print(df)

Original DataFrame:
   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s004    VI    David Parkes    15/09/1997      32

Set school code 's004' to 's005':
   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s005    VI    David Parkes    15/09/1997      32

Set date_of_birth of 'Alberto Franco' to '16/05/2002':
   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    16/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s005    VI    David Parkes    15/09/1997      32

##### 9. Write a Pandas program to convert index of a given dataframe into a column.

In [94]:
data = {
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],    
}

df = pd.DataFrame(
    data,
    index=['t1', 't2', 't3', 't4', 't5', 't6']
)

print('Origin DataFrame:')
print(df)

print()

print('Reset index:')
print(df.reset_index(names=['t_id']))

Origin DataFrame:
   school_code class            name date_of_birth  weight  address
t1        s001     V  Alberto Franco    15/05/2002      35  street1
t2        s002     V    Gino Mcneill    17/05/2002      32  street2
t3        s003    VI     Ryan Parkes    16/02/1999      33  street3
t4        s001    VI    Eesha Hinton    25/09/1998      30  street1
t5        s002     V    Gino Mcneill    11/05/2002      31  street2
t6        s004    VI    David Parkes    15/09/1997      32  street4

Reset index:
  t_id school_code class            name date_of_birth  weight  address
0   t1        s001     V  Alberto Franco    15/05/2002      35  street1
1   t2        s002     V    Gino Mcneill    17/05/2002      32  street2
2   t3        s003    VI     Ryan Parkes    16/02/1999      33  street3
3   t4        s001    VI    Eesha Hinton    25/09/1998      30  street1
4   t5        s002     V    Gino Mcneill    11/05/2002      31  street2
5   t6        s004    VI    David Parkes    15/09/1997      32  street4

In [95]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
print("Original DataFrame:")
print(df)
print("\nConvert index of the said dataframe into a column:")
df.reset_index(level=0, inplace=True)
print(df)

Original DataFrame:
   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s004    VI    David Parkes    15/09/1997      32

Convert index of the said dataframe into a column:
  index school_code class            name date_of_birth  weight
0    t1        s001     V  Alberto Franco    15/05/2002      35
1    t2        s002     V    Gino Mcneill    17/05/2002      32
2    t3        s003    VI     Ryan Parkes    16/02/1999      33
3    t4        s001    VI    Eesha Hinton    25/09/1998      30
4    t5        s002     V    Gino Mcneill    11/05/2002      31
5    t6        s004    VI    David Parkes    15/09/1997      32

##### 10. Write a Pandas program to convert 1st and 3rd levels in the index into columns from a multiple level of index frame of a given dataframe.

In [102]:
df = pd.DataFrame(data).set_index(['t_id', 'school_code', 'class'])
print(df.reset_index([0,2]))

print()

print(df.reset_index(['t_id', 'class']))

            t_id class            name date_of_birth  weight  address
school_code
s001          t1     V  Alberto Franco    15/05/2002      35  street1
s002          t2     V    Gino Mcneill    17/05/2002      32  street2
s003          t3    VI     Ryan Parkes    16/02/1999      33  street3
s001          t4    VI    Eesha Hinton    25/09/1998      30  street1
s002          t5     V    Gino Mcneill    11/05/2002      31  street2
s004          t6    VI    David Parkes    15/09/1997      32  street4

            t_id class            name date_of_birth  weight  address
school_code
s001          t1     V  Alberto Franco    15/05/2002      35  street1
s002          t2     V    Gino Mcneill    17/05/2002      32  street2
s003          t3    VI     Ryan Parkes    16/02/1999      33  street3
s001          t4    VI    Eesha Hinton    25/09/1998      30  street1
s002          t5     V    Gino Mcneill    11/05/2002      31  street2
s004          t6    VI    David Parkes    15/09/1997      32  street4

##### 11. Write a Pandas program to check if a specified value exists in single and multiple column index dataframe.

In [111]:
df_single = pd.DataFrame(data).set_index(['t_id'])
print(df_single)

print('Check if t1 exists in single index:')
print('t1' in df_single.index)

print()

df_multiple = pd.DataFrame(data).set_index(['t_id', 'school_code', 'class'])
print(df_multiple)

print('Check if t1 exists in multiple index:')
print(('t3', 's003', 'VI') in df_multiple.index)

print()

print('t3' in df_multiple.index.levels[0])
print('t3' in df_multiple.index.levels[1])
print('t3' in df_multiple.index.levels[2])

     school_code class            name date_of_birth  weight  address
t_id
t1          s001     V  Alberto Franco    15/05/2002      35  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s004    VI    David Parkes    15/09/1997      32  street4
Check if t1 exists in single index:
True

                                  name date_of_birth  weight  address
t_id school_code class
t1   s001        V      Alberto Franco    15/05/2002      35  street1
t2   s002        V        Gino Mcneill    17/05/2002      32  street2
t3   s003        VI        Ryan Parkes    16/02/1999      33  street3
t4   s001        VI       Eesha Hinton    25/09/1998      30  street1
t5   s002        V        Gino Mcneill    11/05/2002      31  street2
t6   s004        VI       David Parkes    15/09/1997      32  street4
Check if t1 exists in multiple index:
True

True
False
False

##### 12. Write a Pandas program to construct a series using the MultiIndex levels as the column and index

In [121]:
df = pd.DataFrame(data).set_index(['t_id', 'school_code', 'class'])

sr = pd.Series(df.index.levels[0], index=df.index.levels[0])
sr

t_id
t1    t1
t2    t2
t3    t3
t4    t4
t5    t5
t6    t6
Name: t_id, dtype: object

In [123]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]

sales_tuples = list(zip(*sales_arrays))

print("Create a MultiIndex:")
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])

print(sales_tuples)

print("\nConstruct a series using the said MultiIndex levels: ")
s = pd.Series(np.random.randn(8), index = sales_index)
print(s)

Create a MultiIndex:
[('sale1', 'city1'), ('sale1', 'city2'), ('sale2', 'city1'), ('sale2', 'city2'), ('sale3', 'city1'), ('sale3', 'city2'), ('sale4', 'city1'), ('sale4', 'city2')]

Construct a series using the said MultiIndex levels:
sale   city
sale1  city1   -1.126575
       city2   -0.462578
sale2  city1   -0.161240
       city2    0.418881
sale3  city1   -0.528532
       city2   -0.295039
sale4  city1    0.644201
       city2    1.094488
dtype: float64

##### 13. Write a Pandas program to construct a DataFrame using the MultiIndex levels as the column and index.

In [124]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]

sales_tuples = list(zip(*sales_arrays))

print("Create a MultiIndex:")
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])

df = pd.DataFrame(
    {
        'col1': np.random.randn(8),
        'col2': np.random.randn(8)
    },
    index=sales_index
)
df

Create a MultiIndex:

                 col1      col2
sale  city
sale1 city1  0.331752 -0.365915
      city2 -0.492395  0.283236
sale2 city1 -0.741586  0.047094
      city2 -0.764817  0.011003
sale3 city1 -0.243093 -0.551229
      city2 -1.310425 -1.581215
sale4 city1  0.706901 -1.633951
      city2 -0.220424 -0.276677

##### 14. Write a Pandas program to extract a single row, rows and a specific value from a MultiIndex levels DataFrame.

In [134]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]

sales_tuples = list(zip(*sales_arrays))

print("Create a MultiIndex:")
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])

df = pd.DataFrame(
    {
        'col1': np.random.randn(8),
        'col2': np.random.randn(8)
    },
    index=sales_index
)
print(df)

print()

print(df.loc[('sale1', 'city2')])

print()

print(df.loc['sale1'])

print()

print(df.loc[[('sale1', 'city2'), ('sale4', 'city2')]])

print()

print(
    df.loc[
        ('sale1', 'city2'),
        'col1'
    ]
)

Create a MultiIndex:
                 col1      col2
sale  city
sale1 city1  0.494473 -0.394088
      city2  0.579568 -1.110004
sale2 city1  1.002543 -1.326792
      city2  0.892892  0.997781
sale3 city1 -0.694204 -0.800412
      city2  1.097270  0.652800
sale4 city1 -0.250692  0.244998
      city2 -1.662033  0.493404

col1    0.579568
col2   -1.110004
Name: (sale1, city2), dtype: float64

           col1      col2
city
city1  0.494473 -0.394088
city2  0.579568 -1.110004

                 col1      col2
sale  city
sale1 city2  0.579568 -1.110004
sale4 city2 -1.662033  0.493404

0.5795682681446536

In [135]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]
sales_tuples = list(zip(*sales_arrays))
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])
print(sales_tuples)
print("\nConstruct a Dataframe using the said MultiIndex levels: ")
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
print(df)

print("\nExtract a single row from the said dataframe:")
print(df.loc[('sale2', 'city2')])
print("\nExtract a single row from the said dataframe:")
print(df.loc[('sale2', 'city2')])

print("\nExtract number of rows from the said dataframe:")
print(df.loc['sale1'])
print("\nExtract number of rows from the said dataframe:")
print(df.loc['sale3'])

print("\nExtract a single value from the said dataframe:")
print(df.loc[('sale1', 'city2'), 1])
print("\nExtract a single value from the said dataframe:")
print(df.loc[('sale4', 'city1'), 4])

[('sale1', 'city1'), ('sale1', 'city2'), ('sale2', 'city1'), ('sale2', 'city2'), ('sale3', 'city1'), ('sale3', 'city2'), ('sale4', 'city1'), ('sale4', 'city2')]

Construct a Dataframe using the said MultiIndex levels:
                    0         1         2         3         4
sale  city
sale1 city1 -0.958299 -0.058449  0.133755 -0.579180  0.033137
      city2 -0.575316 -0.014155 -1.341251  1.926935 -0.850331
sale2 city1 -0.303709  1.204872 -1.268660 -0.874750  1.041180
      city2 -0.913879 -0.861307 -0.128319  1.548147 -1.051515
sale3 city1  0.324464  0.525587 -1.287482  0.164145 -0.692867
      city2  0.109196 -0.295930  0.836939 -0.947057 -1.426453
sale4 city1  0.438480  0.079959 -0.871417  0.909603  0.642672
      city2 -1.241558  0.427240  1.122593 -1.063537 -1.298776

Extract a single row from the said dataframe:
0   -0.913879
1   -0.861307
2   -0.128319
3    1.548147
4   -1.051515
Name: (sale2, city2), dtype: float64

Extract a single row from the said dataframe:
0   -0.913879
1   -0.861307
2   -0.128319
3    1.548147
4   -1.051515
Name: (sale2, city2), dtype: float64

Extract number of rows from the said dataframe:
              0         1         2         3         4
city
city1 -0.958299 -0.058449  0.133755 -0.579180  0.033137
city2 -0.575316 -0.014155 -1.341251  1.926935 -0.850331

Extract number of rows from the said dataframe:
              0         1         2         3         4
city
city1  0.324464  0.525587 -1.287482  0.164145 -0.692867
city2  0.109196 -0.295930  0.836939 -0.947057 -1.426453

Extract a single value from the said dataframe:
-0.014154962099473528

Extract a single value from the said dataframe:
0.642671828976136

##### 15. Write a Pandas program to rename names of columns and specific labels of the Main Index of the MultiIndex dataframe.

In [152]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]
sales_tuples = list(zip(*sales_arrays))
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])
print(sales_tuples)
print("\nConstruct a Dataframe using the said MultiIndex levels: ")
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
print(df)

# df.rename(['col1', 'col2', 'col3', 'col4', 'col5'], axis=1)
# print(df)

df1 = df.rename(columns={0: 'col1', 1: 'col2', 2:'col3', 3:'col4', 4:'col5'})
df1 = df.rename(index={'sale1': 'sale01'})

print(df1)

[('sale1', 'city1'), ('sale1', 'city2'), ('sale2', 'city1'), ('sale2', 'city2'), ('sale3', 'city1'), ('sale3', 'city2'), ('sale4', 'city1'), ('sale4', 'city2')]

Construct a Dataframe using the said MultiIndex levels:
                    0         1         2         3         4
sale  city
sale1 city1 -0.801989 -0.023313  0.689480  0.398542 -1.042383
      city2  2.597621 -1.201406 -0.685342 -1.191953 -0.573519
sale2 city1 -1.653272  0.728137  0.610571 -1.626672  1.252620
      city2 -0.917163 -0.677330 -1.267257 -0.941842 -0.197446
sale3 city1 -1.081170 -1.096614  0.412016 -0.999000 -0.226744
      city2  1.652684 -1.637614  0.036094  1.215374 -1.643738
sale4 city1 -0.087188  3.106677 -1.441770  1.063011  0.617671
      city2  0.000243  0.397142  0.339212 -0.248989 -0.251070
                     0         1         2         3         4
sale   city
sale01 city1 -0.801989 -0.023313  0.689480  0.398542 -1.042383
       city2  2.597621 -1.201406 -0.685342 -1.191953 -0.573519
sale2  city1 -1.653272  0.728137  0.610571 -1.626672  1.252620
       city2 -0.917163 -0.677330 -1.267257 -0.941842 -0.197446
sale3  city1 -1.081170 -1.096614  0.412016 -0.999000 -0.226744
       city2  1.652684 -1.637614  0.036094  1.215374 -1.643738
sale4  city1 -0.087188  3.106677 -1.441770  1.063011  0.617671
       city2  0.000243  0.397142  0.339212 -0.248989 -0.251070

In [154]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]
sales_tuples = list(zip(*sales_arrays))
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])
print(sales_tuples)

print("\nConstruct a Dataframe using the said MultiIndex levels: ")
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
print(df)

print("\nRename the columns name of the said dataframe")
df1 = df.rename(columns={0: "col1", 1: "col2", 2:"col3", 3:"col4", 4:"col5"})
print(df1)

print("\nRename specific labels of the main index of the DataFrame")
df2 = df1.rename(index={"sale2": "S2", "city2": "C2"})
print(df2)

[('sale1', 'city1'), ('sale1', 'city2'), ('sale2', 'city1'), ('sale2', 'city2'), ('sale3', 'city1'), ('sale3', 'city2'), ('sale4', 'city1'), ('sale4', 'city2')]

Construct a Dataframe using the said MultiIndex levels:
                    0         1         2         3         4
sale  city
sale1 city1 -1.661590  1.611944  1.378430  0.774555 -1.137656
      city2  0.308001 -2.415434  0.985226  0.694877  1.214920
sale2 city1  1.489618 -0.171681  2.086681 -0.909128  0.067806
      city2 -1.004778 -2.241166 -1.022636 -0.744691 -0.142704
sale3 city1  2.117257 -0.024488  0.960100 -0.399702 -1.003859
      city2 -0.822534  1.869649 -1.830463 -0.532545 -0.033482
sale4 city1  0.626235  0.087238  0.920446  1.538963  0.023577
      city2 -1.600986 -0.206724 -1.771958 -0.871884 -1.130193

Rename the columns name of the said dataframe
                 col1      col2      col3      col4      col5
sale  city
sale1 city1 -1.661590  1.611944  1.378430  0.774555 -1.137656
      city2  0.308001 -2.415434  0.985226  0.694877  1.214920
sale2 city1  1.489618 -0.171681  2.086681 -0.909128  0.067806
      city2 -1.004778 -2.241166 -1.022636 -0.744691 -0.142704
sale3 city1  2.117257 -0.024488  0.960100 -0.399702 -1.003859
      city2 -0.822534  1.869649 -1.830463 -0.532545 -0.033482
sale4 city1  0.626235  0.087238  0.920446  1.538963  0.023577
      city2 -1.600986 -0.206724 -1.771958 -0.871884 -1.130193

Rename specific labels of the main index of the DataFrame
                 col1      col2      col3      col4      col5
sale  city
sale1 city1 -1.661590  1.611944  1.378430  0.774555 -1.137656
      C2     0.308001 -2.415434  0.985226  0.694877  1.214920
S2    city1  1.489618 -0.171681  2.086681 -0.909128  0.067806
      C2    -1.004778 -2.241166 -1.022636 -0.744691 -0.142704
sale3 city1  2.117257 -0.024488  0.960100 -0.399702 -1.003859
      C2    -0.822534  1.869649 -1.830463 -0.532545 -0.033482
sale4 city1  0.626235  0.087238  0.920446  1.538963  0.023577
      C2    -1.600986 -0.206724 -1.771958 -0.871884 -1.130193

##### 16. Write a Pandas program to sort a MultiIndex of a DataFrame. Also sort on various levels of index.

In [14]:
df = pd.DataFrame(data).set_index(['school_code', 'class', 't_id',])

print(df.sort_index(ascending=[False, True]))

print(df.sort_index(level=2, ascending=True))

                                  name date_of_birth  weight  address
school_code class t_id
s004        VI    t6      David Parkes    15/09/1997      32  street4
s003        VI    t3       Ryan Parkes    16/02/1999      33  street3
s002        V     t2      Gino Mcneill    17/05/2002      32  street2
                  t5      Gino Mcneill    11/05/2002      31  street2
s001        V     t1    Alberto Franco    15/05/2002      35  street1
            VI    t4      Eesha Hinton    25/09/1998      30  street1
                                  name date_of_birth  weight  address
school_code class t_id
s001        V     t1    Alberto Franco    15/05/2002      35  street1
s002        V     t2      Gino Mcneill    17/05/2002      32  street2
s003        VI    t3       Ryan Parkes    16/02/1999      33  street3
s001        VI    t4      Eesha Hinton    25/09/1998      30  street1
s002        V     t5      Gino Mcneill    11/05/2002      31  street2
s004        VI    t6      David Parkes    15/09/1997      32  street4

In [16]:
sales_arrays = [['sale1', 'sale1', 'sale3', 'sale3', 'sale2', 'sale2', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]
sales_tuples = list(zip(*sales_arrays))
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])
print(sales_tuples)

print("\nConstruct a Dataframe using the said MultiIndex levels: ")
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
print(df)

print("\nSort on MultiIndex DataFrame:")
df1 = df.sort_index()

print("\nSort on Index level=0 of the DataFrame:")
df2 = df.sort_index(level=0)
print(df2)

print("\nSort on Index level=1 of the DataFrame:")
df2 = df.sort_index(level=1)
print(df2)

print("\nPass a level name to sort the DataFrame:")
df3 = df.sort_index(level="city")
print(df3)

[('sale1', 'city1'), ('sale1', 'city2'), ('sale3', 'city1'), ('sale3', 'city2'), ('sale2', 'city1'), ('sale2', 'city2'), ('sale4', 'city1'), ('sale4', 'city2')]

Construct a Dataframe using the said MultiIndex levels:
                    0         1         2         3         4
sale  city
sale1 city1  0.963268  1.151426 -0.199250 -1.304652 -0.455610
      city2 -1.681683  0.975900  1.272086  1.559589 -1.342503
sale3 city1  0.262762 -0.450251  0.758762  0.819838 -2.079423
      city2  0.077117  0.458531 -0.169995  1.013179 -0.808120
sale2 city1 -0.400005 -0.007096  0.560589  0.749606 -0.416984
      city2  1.213597 -1.454422  1.521789 -0.604304 -0.642892
sale4 city1 -0.200729  0.735449  2.005520  1.291350 -0.118630
      city2  1.569471  1.283525  0.330375 -0.017179  0.344334

Sort on MultiIndex DataFrame:

Sort on Index level=0 of the DataFrame:
                    0         1         2         3         4
sale  city
sale1 city1  0.963268  1.151426 -0.199250 -1.304652 -0.455610
      city2 -1.681683  0.975900  1.272086  1.559589 -1.342503
sale2 city1 -0.400005 -0.007096  0.560589  0.749606 -0.416984
      city2  1.213597 -1.454422  1.521789 -0.604304 -0.642892
sale3 city1  0.262762 -0.450251  0.758762  0.819838 -2.079423
      city2  0.077117  0.458531 -0.169995  1.013179 -0.808120
sale4 city1 -0.200729  0.735449  2.005520  1.291350 -0.118630
      city2  1.569471  1.283525  0.330375 -0.017179  0.344334

Sort on Index level=1 of the DataFrame:
                    0         1         2         3         4
sale  city
sale1 city1  0.963268  1.151426 -0.199250 -1.304652 -0.455610
sale2 city1 -0.400005 -0.007096  0.560589  0.749606 -0.416984
sale3 city1  0.262762 -0.450251  0.758762  0.819838 -2.079423
sale4 city1 -0.200729  0.735449  2.005520  1.291350 -0.118630
sale1 city2 -1.681683  0.975900  1.272086  1.559589 -1.342503
sale2 city2  1.213597 -1.454422  1.521789 -0.604304 -0.642892
sale3 city2  0.077117  0.458531 -0.169995  1.013179 -0.808120
sale4 city2  1.569471  1.283525  0.330375 -0.017179  0.344334

Pass a level name to sort the DataFrame:
                    0         1         2         3         4
sale  city
sale1 city1  0.963268  1.151426 -0.199250 -1.304652 -0.455610
sale2 city1 -0.400005 -0.007096  0.560589  0.749606 -0.416984
sale3 city1  0.262762 -0.450251  0.758762  0.819838 -2.079423
sale4 city1 -0.200729  0.735449  2.005520  1.291350 -0.118630
sale1 city2 -1.681683  0.975900  1.272086  1.559589 -1.342503
sale2 city2  1.213597 -1.454422  1.521789 -0.604304 -0.642892
sale3 city2  0.077117  0.458531 -0.169995  1.013179 -0.808120
sale4 city2  1.569471  1.283525  0.330375 -0.017179  0.344334

##### 17. Write a Pandas program to extract elements in the given positional indices along an axis of a dataframe.

In [20]:
df = pd.DataFrame(data)
df.iloc[[0, 3, 5]]

  school_code class            name date_of_birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [21]:
sales_arrays = [
    ['sale1', 'sale1', 'sale3', 'sale3', 'sale2', 'sale2', 'sale4', 'sale4'],
    ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']
]

sales_tuples = list(zip(*sales_arrays))

sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])

print("\nConstruct a Dataframe using the said MultiIndex levels:")
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
print(df)

print("\nSelect 1st, 2nd and 3rd row of the said DataFrame:")
positions = [1, 2, 5]
print(df.take([1, 2, 5]))

print("\nTake elements at indices 1 and 2 along the axis 1 (column selection):")
print(df.take([1, 2], axis=1))

print("\nTake elements at indices 4 and 3 using negative integers along the axis 1 (column selection):")
print(df.take([-1, -2], axis=1))

Construct a Dataframe using the said MultiIndex levels:
                    0         1         2         3         4
sale  city
sale1 city1  1.669647  0.532214 -0.144711  1.154111 -0.118018
      city2  0.126763 -1.082551  0.774104 -0.375904  0.285547
sale3 city1 -0.056733 -1.039349 -0.239406 -0.924681  1.393839
      city2 -0.763363 -0.255781  0.855940  0.268636  1.696786
sale2 city1  0.302055  0.675086 -0.264037  0.788592  0.061129
      city2 -0.765030 -1.000858 -0.009656 -1.115724 -1.403069
sale4 city1 -0.066347  1.587716  1.598516 -1.443227  0.818394
      city2 -0.634479  0.051299  0.320438 -0.327860  0.537212

Select 1st, 2nd and 3rd row of the said DataFrame:
                    0         1         2         3         4
sale  city
sale1 city2  0.126763 -1.082551  0.774104 -0.375904  0.285547
sale3 city1 -0.056733 -1.039349 -0.239406 -0.924681  1.393839
sale2 city2 -0.765030 -1.000858 -0.009656 -1.115724 -1.403069

Take elements at indices 1 and 2 along the axis 1 (column selection):
                    1         2
sale  city
sale1 city1  0.532214 -0.144711
      city2 -1.082551  0.774104
sale3 city1 -1.039349 -0.239406
      city2 -0.255781  0.855940
sale2 city1  0.675086 -0.264037
      city2 -1.000858 -0.009656
sale4 city1  1.587716  1.598516
      city2  0.051299  0.320438

Take elements at indices 4 and 3 using negative integers along the axis 1 (column selection):
                    4         3
sale  city
sale1 city1 -0.118018  1.154111
      city2  0.285547 -0.375904
sale3 city1  1.393839 -0.924681
      city2  1.696786  0.268636
sale2 city1  0.061129  0.788592
      city2 -1.403069 -1.115724
sale4 city1  0.818394 -1.443227
      city2  0.537212 -0.327860

In [25]:
sales_arrays = [
    ['sale1', 'sale1', 'sale3', 'sale3', 'sale2', 'sale2', 'sale4', 'sale4'],
    ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']
]

sales_tuples = list(zip(*sales_arrays))

sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])

print("\nConstruct a Dataframe using the said MultiIndex levels:")
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
print(df)

print("\nSelect 1st, 2nd and 3rd row of the said DataFrame:")
positions = [1, 2, 5]
print(df.iloc[[1, 2, 5]])

print("\nTake elements at indices 1 and 2 along the axis 1 (column selection):")
print(df.iloc[:,[1, 2]])

print("\nTake elements at indices 4 and 3 using negative integers along the axis 1 (column selection):")
print(df.iloc[:, [-1, -2]])

Construct a Dataframe using the said MultiIndex levels:
                    0         1         2         3         4
sale  city
sale1 city1 -0.750048 -0.748915  0.463529  2.070737  0.641090
      city2 -0.335943 -0.841960  0.817847 -0.686819  0.122065
sale3 city1  0.316205 -0.110960  1.275181  1.184040 -0.287320
      city2 -1.091410 -1.213510 -1.746212  0.271879 -0.292771
sale2 city1 -1.069183 -1.554628 -0.178355  1.127426  0.068783
      city2  0.283104 -0.099899 -0.107489 -0.247472 -0.213314
sale4 city1  0.875730  1.252672 -0.906480 -0.636244  0.786451
      city2 -1.524996  1.416074 -1.001781  0.267291  3.193680

Select 1st, 2nd and 3rd row of the said DataFrame:
                    0         1         2         3         4
sale  city
sale1 city2 -0.335943 -0.841960  0.817847 -0.686819  0.122065
sale3 city1  0.316205 -0.110960  1.275181  1.184040 -0.287320
sale2 city2  0.283104 -0.099899 -0.107489 -0.247472 -0.213314

Take elements at indices 1 and 2 along the axis 1 (column selection):
                    1         2
sale  city
sale1 city1 -0.748915  0.463529
      city2 -0.841960  0.817847
sale3 city1 -0.110960  1.275181
      city2 -1.213510 -1.746212
sale2 city1 -1.554628 -0.178355
      city2 -0.099899 -0.107489
sale4 city1  1.252672 -0.906480
      city2  1.416074 -1.001781

Take elements at indices 4 and 3 using negative integers along the axis 1 (column selection):
                    4         3
sale  city
sale1 city1  0.641090  2.070737
      city2  0.122065 -0.686819
sale3 city1 -0.287320  1.184040
      city2 -0.292771  0.271879
sale2 city1  0.068783  1.127426
      city2 -0.213314 -0.247472
sale4 city1  0.786451 -0.636244
      city2  3.193680  0.267291

##### 18. Write a Pandas program to get the index of an element of a given Series.

In [30]:
sr = pd.Series(['one', 'two', 'three', 'four', 'five'])
print(sr[sr == 'three'].index[0])

2

##### 19. Write a Pandas program to select a specific row of given series/dataframe by integer index.

In [38]:
sr = pd.Series(['one', 'two', 'three', 'four', 'five'], index=np.arange(5))
print(sr.iloc[[3]])

print()

df = pd.DataFrame(data)
print(df.iloc[3])
print()
print(df.iloc[[3]])

3    four
dtype: object

school_code              s001
class                      VI
name             Eesha Hinton
date_of_birth      25/09/1998
weight                     30
address               street1
t_id                       t4
Name: 3, dtype: object

  school_code class          name date_of_birth  weight  address t_id
3        s001    VI  Eesha Hinton    25/09/1998      30  street1   t4

##### 20. Write a Pandas program to find the indexes of rows of a specified value of a given column in a DataFrame.

In [47]:
df = pd.DataFrame(data)

print(df)

print('Index of rows of value "Ryan Parkes" of column "name":')
print(df[df.name == 'Ryan Parkes'].index.tolist())

print('Index of rows of value "street1" of column "address":')
print(df[df.address == 'street1'].index.tolist())

  school_code class            name date_of_birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6
Index of rows of value "Ryan Parkes" of column "name":
[2]
Index of rows of value "street1" of column "address":
[0, 3]

##### 21. Write a Pandas program to drop a index level from a multi-level column index of a dataframe.

In [60]:
sales_arrays = [
    ['sale1', 'sale1', 'sale3', 'sale3', 'sale2', 'sale2', 'sale4', 'sale4'],
    ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']
]

sales_tuples = list(zip(*sales_arrays))

sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])

print("\nConstruct a Dataframe using the said MultiIndex levels:")
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
print(df)

print()

df.index = df.index.droplevel(0)
print(df)

Construct a Dataframe using the said MultiIndex levels:
                    0         1         2         3         4
sale  city
sale1 city1 -1.584569 -1.083253  0.370500  0.618892  0.397473
      city2 -0.649138  0.748898 -0.219564 -0.081809  1.812130
sale3 city1  0.543749 -0.238785  0.296219  0.579507  0.031020
      city2  1.772324  0.750015 -0.146963 -0.587147  0.142403
sale2 city1  0.783693 -0.960256  0.206593 -0.996800 -1.192024
      city2  0.786271  0.265155  0.046738 -1.323303 -0.520950
sale4 city1  0.983352  0.517707 -0.038306  0.358908  0.330795
      city2 -0.871965  1.139927 -0.664983  0.151532  0.630499

              0         1         2         3         4
city
city1 -1.584569 -1.083253  0.370500  0.618892  0.397473
city2 -0.649138  0.748898 -0.219564 -0.081809  1.812130
city1  0.543749 -0.238785  0.296219  0.579507  0.031020
city2  1.772324  0.750015 -0.146963 -0.587147  0.142403
city1  0.783693 -0.960256  0.206593 -0.996800 -1.192024
city2  0.786271  0.265155  0.046738 -1.323303 -0.520950
city1  0.983352  0.517707 -0.038306  0.358908  0.330795
city2 -0.871965  1.139927 -0.664983  0.151532  0.630499

In [61]:
cols = pd.MultiIndex.from_tuples([("a", "x"), ("a", "y"), ("a", "z")])

print("\nConstruct a Dataframe using the said MultiIndex levels: ")
df = pd.DataFrame([[1,2,3], [3,4,5], [5,6,7]], columns=cols)
print(df)

#Levels are 0-indexed beginning from the top.
print("\nRemove the top level index:")
df.columns = df.columns.droplevel(0)
print(df)

df = pd.DataFrame([[1,2,3], [3,4,5], [5,6,7]], columns=cols)
print("\nOriginal dataframe:")
print(df)

print("\nRemove the index next to top level:")
df.columns = df.columns.droplevel(1)
print(df)

Construct a Dataframe using the said MultiIndex levels:
   a
   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

Remove the top level index:
   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

Original dataframe:
   a
   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

Remove the index next to top level:
   a  a  a
0  1  2  3
1  3  4  5
2  5  6  7

##### 22. Write a Pandas program to insert a column at a specific index in a given DataFrame.

In [64]:
print("\nConstruct a Dataframe using the said MultiIndex levels: ")
df = pd.DataFrame([[1,2,3], [3,4,5], [5,6,7]], columns=['x', 'y', 'z'])
print(df)

print()

df['w'] = pd.Series([8,9,0])
print(df)

Construct a Dataframe using the said MultiIndex levels:
   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

   x  y  z  w
0  1  2  3  8
1  3  4  5  9
2  5  6  7  0

In [67]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  [1, 2, 3, 4, 5, 6])
print("Original DataFrame with single index:\n")
print(df)

date_of_birth = ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997']
idx = 3

print("\nInsert 'date_of_birth' column in 3rd position of the said DataFrame:\n")
df.insert(loc=idx, column='date_of_birth', value=date_of_birth)
print(df)

Original DataFrame with single index:

  school_code class            name  weight
1        s001     V  Alberto Franco      35
2        s002     V    Gino Mcneill      32
3        s003    VI     Ryan Parkes      33
4        s001    VI    Eesha Hinton      30
5        s002     V    Gino Mcneill      31
6        s004    VI    David Parkes      32

Insert 'date_of_birth' column in 3rd position of the said DataFrame:

  school_code class            name date_of_birth  weight
1        s001     V  Alberto Franco    15/05/2002      35
2        s002     V    Gino Mcneill    17/05/2002      32
3        s003    VI     Ryan Parkes    16/02/1999      33
4        s001    VI    Eesha Hinton    25/09/1998      30
5        s002     V    Gino Mcneill    11/05/2002      31
6        s004    VI    David Parkes    15/09/1997      32

##### 23. Write a Pandas program to print a DataFrame without index.

In [71]:
df = pd.DataFrame(data)
print(df.to_string(index=False))

school_code class           name date_of_birth  weight address t_id
       s001     V Alberto Franco    15/05/2002      35 street1   t1
       s002     V   Gino Mcneill    17/05/2002      32 street2   t2
       s003    VI    Ryan Parkes    16/02/1999      33 street3   t3
       s001    VI   Eesha Hinton    25/09/1998      30 street1   t4
       s002     V   Gino Mcneill    11/05/2002      31 street2   t5
       s004    VI   David Parkes    15/09/1997      32 street4   t6

##### 24. Write a Pandas program to find integer index of rows with missing data in a given dataframe.

In [104]:
df = pd.DataFrame(
    {
        'school_code': ['s001','s002','s003','s001','s002','s004'],
        'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
        'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
        'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
        'weight': [35, None, 33, 30, 31, None]
    },
    index = ['t1', 't2', 't3', 't4', 't5', 't6']
)

print(df)

index = df[df.isna().any(axis=1)].index.values.tolist()
print(index)

df_index = df.index.values.tolist()
print(df_index)

print("\nInteger index of rows with missing data in 'weight' column of the said dataframe:")
print([df_index.index(i) for i in index])

df_index.index('t3')

   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002    35.0
t2        s002     V    Gino Mcneill    17/05/2002     NaN
t3        s003    VI     Ryan Parkes    16/02/1999    33.0
t4        s001    VI    Eesha Hinton    25/09/1998    30.0
t5        s002     V    Gino Mcneill    11/05/2002    31.0
t6        s004    VI    David Parkes    15/09/1997     NaN
['t2', 't6']
['t1', 't2', 't3', 't4', 't5', 't6']

Integer index of rows with missing data in 'weight' column of the said dataframe:
[1, 5]

2

In [101]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])

print("Original DataFrame:")
print(df)

index = df['weight'].index[df['weight'].apply(np.isnan)]
print(index)

df_index = df.index.values.tolist()
print(df_index)

print("\nInteger index of rows with missing data in 'weight' column of the said dataframe:")
print([df_index.index(i) for i in index])

Original DataFrame:
   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002    35.0
t2        s002     V    Gino Mcneill    17/05/2002     NaN
t3        s003    VI     Ryan Parkes    16/02/1999    33.0
t4        s001    VI    Eesha Hinton    25/09/1998    30.0
t5        s002     V    Gino Mcneill    11/05/2002    31.0
t6        s004    VI    David Parkes    15/09/1997     NaN
Index(['t2', 't6'], dtype='object')
['t1', 't2', 't3', 't4', 't5', 't6']

Integer index of rows with missing data in 'weight' column of the said dataframe:
[1, 5]

##### 25. Write a Pandas program to start index with different value rather than 0 in a given DataFrame.

In [112]:
df = pd.DataFrame(data)
df.index += 10

df

   school_code class            name date_of_birth  weight  address t_id
10        s001     V  Alberto Franco    15/05/2002      35  street1   t1
11        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
12        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
13        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
14        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
15        s004    VI    David Parkes    15/09/1997      32  street4   t6

##### 26. Write a Pandas program to select rows by filtering on one or more column(s) in a multi-index dataframe.

In [119]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]
sales_tuples = list(zip(*sales_arrays))
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])
print(sales_tuples)
print("\nConstruct a Dataframe using the said MultiIndex levels: ")
df = pd.DataFrame(np.arange(40).reshape(8, 5), index=sales_index)
print(df)

df[(df[0] == 10) | (df[3] == 8)]

[('sale1', 'city1'), ('sale1', 'city2'), ('sale2', 'city1'), ('sale2', 'city2'), ('sale3', 'city1'), ('sale3', 'city2'), ('sale4', 'city1'), ('sale4', 'city2')]

Construct a Dataframe using the said MultiIndex levels:
              0   1   2   3   4
sale  city
sale1 city1   0   1   2   3   4
      city2   5   6   7   8   9
sale2 city1  10  11  12  13  14
      city2  15  16  17  18  19
sale3 city1  20  21  22  23  24
      city2  25  26  27  28  29
sale4 city1  30  31  32  33  34
      city2  35  36  37  38  39

sale   city
sale1  city1    False
       city2     True
sale2  city1     True
       city2    False
sale3  city1    False
       city2    False
sale4  city1    False
       city2    False
dtype: bool

In [132]:
df = pd.DataFrame(
    {
        'school_code': ['s001','s002','s003','s001','s002','s004'],
        'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
        'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
        'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
        'weight': [35, 37, 33, 30, 31, 32],
        'tcode': ['t1', 't2', 't3', 't4', 't5', 't6']
    }
)    

print("Original DataFrame:")
print(df)

print("\nCreate MultiIndex on 'tcode' and 'school_code':")
df = df.set_index(['tcode', 'school_code'])
print(df)

print("\nSelect rows(s) from 'tcode' column:")
print(df.query("tcode == 't2'"))

print("\nSelect rows(s) from 'school_code' column:")
print(df.query("school_code == 's001'"))

print("\nSelect rows(s) from 'tcode' and 'scode' columns:")
print(df.query(("tcode == 't1'") and ("school_code == 's001'")))

print("\nSelect rows(s) from 'tcode' and 'school_code' columns:")
print(df[(df.index.get_level_values('tcode') == 't1') & (df.index.get_level_values('school_code') == 's001')])

print("\nSelect rows(s) from 'tcode' and 'school_code' columns:")
print(df.loc[[('t1','s001')]])

Original DataFrame:
  school_code class            name date_of_birth  weight tcode
0        s001     V  Alberto Franco    15/05/2002      35    t1
1        s002     V    Gino Mcneill    17/05/2002      37    t2
2        s003    VI     Ryan Parkes    16/02/1999      33    t3
3        s001    VI    Eesha Hinton    25/09/1998      30    t4
4        s002     V    Gino Mcneill    11/05/2002      31    t5
5        s004    VI    David Parkes    15/09/1997      32    t6

Create MultiIndex on 'tcode' and 'school_code':
                  class            name date_of_birth  weight
tcode school_code
t1    s001            V  Alberto Franco    15/05/2002      35
t2    s002            V    Gino Mcneill    17/05/2002      37
t3    s003           VI     Ryan Parkes    16/02/1999      33
t4    s001           VI    Eesha Hinton    25/09/1998      30
t5    s002            V    Gino Mcneill    11/05/2002      31
t6    s004           VI    David Parkes    15/09/1997      32

Select rows(s) from 'tcode' column:
                  class          name date_of_birth  weight
tcode school_code
t2    s002            V  Gino Mcneill    17/05/2002      37

Select rows(s) from 'school_code' column:
                  class            name date_of_birth  weight
tcode school_code
t1    s001            V  Alberto Franco    15/05/2002      35
t4    s001           VI    Eesha Hinton    25/09/1998      30

Select rows(s) from 'tcode' and 'scode' columns:
                  class            name date_of_birth  weight
tcode school_code
t1    s001            V  Alberto Franco    15/05/2002      35
t4    s001           VI    Eesha Hinton    25/09/1998      30

Select rows(s) from 'tcode' and 'school_code' columns:
                  class            name date_of_birth  weight
tcode school_code
t1    s001            V  Alberto Franco    15/05/2002      35

Select rows(s) from 'tcode' and 'school_code' columns:
                  class            name date_of_birth  weight
tcode school_code
t1    s001            V  Alberto Franco    15/05/2002      35